# Understand concepts here

Here first, I will try to understand the concepts using a small data set.

In [4]:
import pandas as pd

In [5]:
df = pd.DataFrame([
    {'firstName': 'Jhon', 'lastName': 'Wick', 'gender':'male'},
    {'firstName': 'Jack', 'lastName': 'Sparrow', 'gender':'male'},
    {'firstName': 'Maria', 'lastName': 'Sanchez', 'gender':'female'},
    {'firstName': 'Peter', 'lastName': 'Parker', 'gender':'male'},
])

df.head()

  firstName lastName  gender
0      Jhon     Wick    male
1      Jack  Sparrow    male
2     Maria  Sanchez  female
3     Peter   Parker    male

In [6]:
df.columns = ['first_name', 'last_name', 'gender']
df.head()

  first_name last_name  gender
0       Jhon      Wick    male
1       Jack   Sparrow    male
2      Maria   Sanchez  female
3      Peter    Parker    male

In [7]:
df.columns = [x.upper() for x in df.columns]
df.head()

  FIRST_NAME LAST_NAME  GENDER
0       Jhon      Wick    male
1       Jack   Sparrow    male
2      Maria   Sanchez  female
3      Peter    Parker    male

In [8]:
df['FIRST_NAME'] = [x.upper() for x in df['FIRST_NAME']]
df.head()

  FIRST_NAME LAST_NAME  GENDER
0       JHON      Wick    male
1       JACK   Sparrow    male
2      MARIA   Sanchez  female
3      PETER    Parker    male

In [9]:
df

  FIRST_NAME LAST_NAME  GENDER
0       JHON      Wick    male
1       JACK   Sparrow    male
2      MARIA   Sanchez  female
3      PETER    Parker    male

In [11]:
df.rename(columns={'FIRST_NAME': 'first_name'}, inplace=True)
df.head()

  first_name LAST_NAME  GENDER
0       JHON      Wick    male
1       JACK   Sparrow    male
2      MARIA   Sanchez  female
3      PETER    Parker    male